Tekla.Structures.Plugins.ConnectionBase.SecondaryType
Defines how many secondaries a connection can have.

Tekla.Structures.Plugins.ConnectionBase.SecondaryType.SECONDARYTYPE_ZERO
The connection can have zero secondaries.
Zero secondaries means that the connection is a detail.

Tekla.Structures.Plugins.ConnectionBase.SecondaryType.SECONDARYTYPE_ONE
The connection can have one secondary.

Tekla.Structures.Plugins.ConnectionBase.SecondaryType.SECONDARYTYPE_TWO
The connection can have two secondaries.

Tekla.Structures.Plugins.ConnectionBase.SecondaryType.SECONDARYTYPE_MULTIPLE
The connection can have multiple secondaries.